SM_для_EDT/src/Documents/vftСообщениеОПотенциальномИнциденте/vftСообщениеОПотенциальномИнциденте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>vftСообщениеОПотенциальномИнциденте</name>
  <posting>Deny</posting>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.vftСтатусыДокументовСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Судно</name>
    <type>
      <types>CatalogRef.vftСуда</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремя</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПотенциальногоИнцидента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаВозникновения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозможныеПоследствия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпринятыеДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоСообщившееОбИнциденте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОЛицоСообщившееОбИнциденте</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОКапитана</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветКомпании</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

SM_для_EDT/src/Enums/vftСтатусыДокументовСообщений/vftСтатусыДокументовСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>vftСтатусыДокументовСообщений</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Инициировано</name>
  </enumValues>
  <enumValues>
    <name>Проведено</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаСудно</name>
  </enumValues>
  <enumValues>
    <name>ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Доработан</name>
  </enumValues>
</mdclass:Enum>

SM_для_EDT/src/Documents/vftСообщениеОПотенциальномИнциденте/ObjectModule.bsl
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)

	//Префикс =  Судно.КодБыстрогоВвода;
	
	Префикс = СформироватьПрефиксНомераДокумента();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	vftОбщиеПроцедурыДокументовСервер.ПриКопировании(ЭтотОбъект,ОбъектКопирования);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	// ++ rarus ilshill 19.01.2020 
	// - перенес в "обработчикПроверкиЗаолнения" 
	
	//МассивРеквизитовДляОбязательногоЗаполнения = Новый Массив;
	//
	//Если Статус <> Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
	//	
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ДатаВремя");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ОписаниеПотенциальногоИнцидента");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ПричинаВозникновения");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ВозможныеПоследствия");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ПредпринятыеДействия");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ЛицоСообщившееОбИнциденте");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОЛицоСообщившееОбИнциденте");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ФИОКапитана");
	//		
	//КонецЕсли; 
	//
	//Если Статус = Перечисления.vftСтатусыДокументовСообщений.Получен 
	//	или Статус = Перечисления.vftСтатусыДокументовСообщений.Закрыт  Тогда
	//	
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("ОтветКомпании");
	//	МассивРеквизитовДляОбязательногоЗаполнения.Добавить("Ответственный");

	//КонецЕсли; 
	//
	//Отказ = НЕ ПроверитьЗаполнение();
	//vftОбщиеПроцедурыДокументовСервер.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект,МассивРеквизитовДляОбязательногоЗаполнения,Отказ);
	//
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("рарусИспользоватьФункционалСУБ") Тогда		
		рарусСУБСервер.ОбработкаЗаполнениеДокументовСУБ(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ДатаВремя");
		МассивНепроверяемыхРеквизитов.Добавить("ОписаниеПотенциальногоИнцидента");
		МассивНепроверяемыхРеквизитов.Добавить("ПричинаВозникновения");
		МассивНепроверяемыхРеквизитов.Добавить("ВозможныеПоследствия");
		МассивНепроверяемыхРеквизитов.Добавить("ПредпринятыеДействия");
		МассивНепроверяемыхРеквизитов.Добавить("ЛицоСообщившееОбИнциденте");
		МассивНепроверяемыхРеквизитов.Добавить("ФИОЛицоСообщившееОбИнциденте");
		МассивНепроверяемыхРеквизитов.Добавить("ФИОКапитана");
		МассивНепроверяемыхРеквизитов.Добавить("Примечание");
		
	КонецЕсли;
	
	Если Статус = Перечисления.vftСтатусыДокументовСообщений.Черновик 
		Или Статус = Перечисления.vftСтатусыДокументовСообщений.Отправлен  Тогда
		
		МассивНепроверяемыхРеквизитов.Добавить("ОтветКомпании");
		МассивНепроверяемыхРеквизитов.Добавить("Ответственный");
		
	КонецЕсли; 
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);	
	
КонецПроцедуры

Функция СформироватьПрефиксНомераДокумента() Экспорт
	
	Префикс = "";
	
	Префикс = Префикс + ?(Судно <> Справочники.vftСуда.ПустаяСсылка(), Судно.КодБыстрогоВвода, "      ");
	Префикс = Префикс + "-";
	Префикс = Префикс + ?(Дата = Дата("00010101000000"), "  ", Прав(Формат(Дата, "ДФ=yyyy"), 2));
	Префикс = Префикс + "-";
	
	Возврат Префикс;
	
КонецФункции
